spec/fixtures/requests/transfer_ownership/unsigned_soap.xml

<soapenv:Envelope 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:v2="http://integration.sprint.com/common/header/WSMessageHeader/v2"
xmlns:sub="http://integration.sprint.com/interfaces/manageDevicePhoneOwnership/v1/manageDevicePhoneOwnership.xsd">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
</wsse:Security>
<v2:wsMessageHeader>
<v2:trackingMessageHeader>
<v2:applicationId>2222333344</v2:applicationId>
<v2:applicationUserId>BEQUICK</v2:applicationUserId>
<v2:messageId>9999999999</v2:messageId>
<v2:timeToLive>0</v2:timeToLive>
<v2:messageDateTimeStamp>2014-01-01T00:00:00.0Z</v2:messageDateTimeStamp>
</v2:trackingMessageHeader>
</v2:wsMessageHeader>
</soapenv:Header>
<soapenv:Body>
<sub:manageDevicePhoneOwnership>
<sub:deviceInfo>
<sub:serialNumberDec>12345678901</sub:serialNumber>
<sub:serialType>E</sub:serialType>
</sub:deviceInfo>
<sub:newPhoneOwnershipCode>PLBL</sub:newPhoneOwnershipCode>
</sub:manageDevicePhoneOwnership>
</soapenv:Body>
</soapenv:Envelope>